DuocdtSelex/BMS4.1/bms-stm32/bms-stm32/component/afe/bq769x2.h
/*
 * sub command bit mask
 */

// FET control register bit mask
#define PCHG_OFF 						(1<<3)
#define CHG_OFF							(1<<2)
#define PDSG_OFF						(1<<1)
#define DSG_OFF							(1<<0)

/*
 * Data RAM bit mask
 */
// FET_OPTION register
#define FET_INIT_OFF 					(1<<5)
#define PDSG_EN							(1<<4)
#define FET_CTRL_EN						(1<<3)
#define HOST_FET_EN						(1<<2)
#define SLEEPCHG						(1<<1)
#define SFET							(1<<0)
// POWER_CONFIG register
#define DPSLD_OT						(1<<13)
#define SHUT_TS2						(1<<12)
#define DPSLP_PD						(1<<11)
#define DPSLP_LDO						(1<<10)
#define DPSLP_LFO						(1<<9)
#define SLEEP_REG						(1<<8)
#define OTSD							(1<<7)
#define FASTADC							(1<<6)
#define CB_LOOP_SLOW_1					(1<<5)
#define CB_LOOP_SLOW_0					(1<<4)
#define LOOP_SLOW_1						(1<<3)
#define LOOP_SLOW_0						(1<<2)

typedef struct _Register_Group BQ_Register_Group;
struct _Register_Group{
	union
	{
		struct
		{
		unsigned short RSVD			:13;
		unsigned char DEEP_SLEEP	:1;
		unsigned char LD_TIMEOUT	:1;
		unsigned char LD_ON 		:1;
		}ControlStatusBit;
		unsigned short ControlStatusByte;
	}ControlStatus;

	union
	{
		struct
		{
			unsigned char SCD 		:1;
			unsigned char OCD2 		:1;
			unsigned char OCD1		:1;
			unsigned char OCC 		:1;
			unsigned char COV 		:1;
			unsigned char CUV 		:1;
			unsigned char RSVD 		:2;
		}SafetyAlertABit;
		unsigned char SatetyAlertAByte;
	}SafetyAlertA;

	union
	{
		struct
		{
			unsigned char SCD 		:1;
			unsigned char OCD2 		:1;
			unsigned char OCD1 		:1;
			unsigned char OCC 		:1;
			unsigned char COV 		:1;
			unsigned char CUV 		:1;
			unsigned char RSVD 		:2;
		}SafetyStatusABit;
		unsigned char SafetyStatusAByte;
	}SafetyStatusA;

	union
	{
		struct
		{
			unsigned char OTF 		:1;
			unsigned char OTINT		:1;
			unsigned char OTD 		:1;
			unsigned char OTC 		:1;
			unsigned char RSVD		:1;
			unsigned char UTINT 	:1;
			unsigned char UTD 		:1;
			unsigned char UTC 		:1;
		}SafetyAlertBBit;
		unsigned char SafetyAlertBByte;
	}SafetyAlertB;

	union
	{
		struct
		{
			unsigned char OTF		:1;
			unsigned char OTINT		:1;
			unsigned char OTD 		:1;
			unsigned char OTC 		:1;
			unsigned char RSVD		:1;
			unsigned char UTINT 	:1;
			unsigned char UTD 		:1;
			unsigned char UTC 		:1;
		}SafetyStatusBBit;
		unsigned char SafetyStatusBByte;
	}SafetyStatusB;

	union
	{
		struct
		{
			unsigned char OCD3  	:1;
			unsigned char SCDL		:1;
			unsigned char OCDL		:1;
			unsigned char COVL 		:1;
			unsigned char PTOS 		:1;
			unsigned char RSVD  	:3;
		}SafetyAlertCBit;
		unsigned char SafetyAlertCByte;
	}SafetyAlertC;

	union
	{
		struct
		{
			unsigned char OCD3 		:1;
			unsigned char SCDL		:1;
			unsigned char OCDL		:1;
			unsigned char COVL 		:1;
			unsigned char RSVD1		:1;
			unsigned char PTO 		:1;
			unsigned char HWDF		:1;
			unsigned char RSVD2 	:1;
		}SafetyStatusCBit;
		unsigned char SafetyStatusCByte;
	}SafetyStatusC;

	union
	{
		struct
		{
			unsigned char CUDEP		:1;
			unsigned char SOTF		:1;
			unsigned char RSVD		:1;
			unsigned char SOT 		:1;
			unsigned char SOCD		:1;
			unsigned char SOCC		:1;
			unsigned char SOV 		:1;
			unsigned char SUV		:1;
		}PFAlertABit;
		unsigned char PFAlertAByte;
	}PFAlertA;

	union
	{
		struct
		{
			unsigned char CUDEP		:1;
			unsigned char SOTF		:1;
			unsigned char RSVD 		:1;
			unsigned char SOT 		:1;
			unsigned char SOCD		:1;
			unsigned char SOCC 		:1;
			unsigned char SOV 		:1;
			unsigned char SUV 		:1;
		}PFStatusABit;
		unsigned char PFStatusAByte;
	}PFStatusA;

	union
	{
		struct
		{
			unsigned char SCDL  	:1;
			unsigned char RSVD		:2;
			unsigned char VIMA		:1;
			unsigned char VIMR		:1;
			unsigned char SLVL		:1;
			unsigned char DFETF 	:1;
			unsigned char CFETF 	:1;
		}PFAlertBBit;
		unsigned char PFAlertBByte;
	}PFAlertB;

	union
	{
		struct
		{
			unsigned char SCDL  	:1;
			unsigned char RSVD		:2;
			unsigned char VIMA		:1;
			unsigned char VIMR		:1;
			unsigned char SLVL		:1;
			unsigned char DFETF 	:1;
			unsigned char CFETF 	:1;
		}PFStatusBBit;
		unsigned char PFStatusBByte;
	}PFStatusB;

	union
	{
		struct
		{
			unsigned char RSVD1 	:1;
			unsigned char HWMX		:1;
			unsigned char VSSF		:1;
			unsigned char VREF		:1;
			unsigned char LFOF		:1;
			unsigned char RSVD2 	:3;
		}PFAlertCBit;
		unsigned char PFAlertCByte;
	}PFAlertC;

	union
	{
		struct
		{
			unsigned char CMDF 		:1;
			unsigned char HWMX		:1;
			unsigned char VSSF		:1;
			unsigned char VREF		:1;
			unsigned char LFOF		:1;
			unsigned char IRMF		:1;
			unsigned char DRMF		:1;
			unsigned char OTPF		:1;
		}PFStatusCBit;
		unsigned char PFStatusCByte;
	}PFStatusC;

	union
	{
		struct
		{
			unsigned char RSVD 		:7;
			unsigned char TOSF		:1;
		}PFAlertDBit;
		unsigned char PFAlertDByte;
	}PFAlertD;

	union
	{
		struct
		{
			unsigned char RSVD 		:7;
			unsigned char TOSF		:1;
		}PFStatusDBit;
		unsigned char PFStatusDByte;
	}PFStatusD;

	union
	{
		struct
		{
			unsigned char SLEEP 	:1;
			unsigned char RSVD 		:1;
			unsigned char SD_CMD	:1;
			unsigned char PF 		:1;
			unsigned char SS 		:1;
			unsigned char FUSE 		:1;
			unsigned char SEC1		:1;
			unsigned char SEC0 		:1;
			unsigned char OTPB		:1;
			unsigned char OTPW		:1;
			unsigned char COW_CHK	:1;
			unsigned char WD 		:1;
			unsigned char POR		:1;
			unsigned char SLEEP_EN	:1;
			unsigned char PCHG_MODE	:1;
			unsigned char CFGUPDATE	:1;
		}BatteryStatusBit;
		unsigned short BatteryStatusByte;
	}BateryStatus;

	union
	{
		struct
		{
			unsigned char SSBC 			:1;
			unsigned char SSA 			:1;
			unsigned char PF 			:1;
			unsigned char MSK_SFALERT 	:1;
			unsigned char MSK_PFALERT	:1;
			unsigned char INITSTART		:1;
			unsigned char INITCOMP		:1;
			unsigned char RSVD 			:1;
			unsigned char FULLSCAN		:1;
			unsigned char XCHG			:1;
			unsigned char XDSG 			:1;
			unsigned char SHUTV			:1;
			unsigned char FUSE			:1;
			unsigned char CB 			:1;
			unsigned char ADSCAN 		:1;
			unsigned char WAKE			:1;
		}AlarmStatusBit;
		unsigned short AlarmStatusByte;
	}AlarmStatus;

	union
	{
		struct
		{
			unsigned char SSBC 			:1;
			unsigned char SSA 			:1;
			unsigned char PF 			:1;
			unsigned char MSK_SFALERT	:1;
			unsigned char MSK_PFALERT	:1;
			unsigned char INITSTART		:1;
			unsigned char INITCOMP 		:1;
			unsigned char RSVD 			:1;
			unsigned char FULLSCAN 		:1;
			unsigned char XCHG 			:1;
			unsigned char CDSG			:1;
			unsigned char SHUTV 		:1;
			unsigned char FUSE 			:1;
			unsigned char CB 			:1;
			unsigned char ADSCAN 		:1;
			unsigned char WAKE 			:1;
		}AlarmRawStatusBit;
		unsigned short AlarmRawStatusByte;
	}AlarmRawStatus;

	union
	{
		struct
		{
			unsigned char SSBC  		:1;
			unsigned char SSA 			:1;
			unsigned char PF 			:1;
			unsigned char MSK_SFALERT	:1;
			unsigned char MSK_PFALERT 	:1;
			unsigned char INITSTART 	:1;
			unsigned char INITCOMP		:1;
			unsigned char RSVD 			:1;
			unsigned char FULLSCAN 		:1;
			unsigned char XCHG 			:1;
			unsigned char XDSG 			:1;
			unsigned char SHUTV 		:1;
			unsigned char FUSE 			:1;
			unsigned char CB 			:1;
			unsigned char ADSCAN		:1;
			unsigned char WAKE 			:1;
		}AlarmEnableBit;
		unsigned short AlarmEnableByte;
	}AlarmEnable;

	union
	{
		struct
		{
			unsigned char RSVD 			:1;
			unsigned char ALRT_PIN 		:1;
			unsigned char DDSG_PIN 		:1;
			unsigned char PDSG_PIN 		:1;
			unsigned char PDSG_FET		:1;
			unsigned char DSG_FET 		:1;
			unsigned char PCHG_FET		:1;
			unsigned char CHG_FET		:1;
		}FETStatusBit;
		unsigned char FETStatusByte;
	}FETStatus;
};

typedef struct BQ769x2_t BQ769x2;

struct BQ769x2_t{
	AFE base;
	BQ_Hw* hw;
	BQ_Register_Group bq_registers;
	uint32_t adc_gain;
	uint32_t adc_offset;
	//BQ_TEMP_MONITOR_SRC temp_monitor_source;
	uint8_t cell_group;
	uint8_t protect_level;
	uint8_t unshort_cell;
};

void bq_init_1(BQ769x2 *p_bq);
void bq_set_cell_group(BQ769x2* p_bq,const uint8_t group);

void bq_turn_off_all_fet(BQ769x2* p_bq);
void bq_turn_on_all_fet(BQ769x2* p_bq);
void bq_turn_off_fet_DSG_PDSG(BQ769x2* p_bq);
void bq_turn_off_fet_CHG_PCHG(BQ769x2* p_bq);
uint8_t bq_read_fet_status_reg(BQ769x2* p_bq);
/*
 *  configure body diode threshold to avoid current damage FETs
 */
void bq_config_body_diode_threshold(BQ769x2* p_bq, uint16_t threshold_mA);
/*
 *  set bit and clear bit for byte or word with direct command
 */
int bq_set_byte_register_bit(BQ769x2* p_bq,uint8_t reg, const uint8_t bit_mask);
int bq_clear_byte_register_bit(BQ769x2* p_bq,uint8_t reg, const uint8_t bit_mask);
int bq_set_word_register_bit(BQ769x2* p_bq,uint16_t reg, const uint16_t bit_mask);
int bq_clear_word_register_bit(BQ769x2* p_bq,uint16_t reg, const uint16_t bit_mask);

int16_t bq_read_ntc_temperature_TS1(BQ769x2* p_bq);
int16_t bq_read_ntc_temperature_TS3(BQ769x2* p_bq);
int16_t bq_read_ntc_temperature_HDQ_TEMP(BQ769x2* p_bq);
int16_t bq_read_ntc_temperature_CFETOFF_TEMP(BQ769x2* p_bq);

int16_t bq_read_cc2_current(BQ769x2* p_bq);
void bq_enter_config_update_mode(BQ769x2* p_bq);
void bq_exit_config_update_mode(BQ769x2* p_bq);
static void bq_clear_alert_bit(BQ769x2* p_bq);

static inline void bq_set_interface(BQ769x2* const p_bq,const AFE_Interface* const p_inf){
	afe_set_interface((AFE*) p_bq,p_inf);
}
static inline uint32_t bq_get_pack_voltage(const BQ769x2* const p_bq){
	return afe_get_pack_voltage((AFE*)p_bq);
}

static inline uint32_t bq_get_cell_voltage(const BQ769x2* const p_bq,const uint8_t cell_id){
	return afe_get_cell_voltage((AFE*)p_bq,cell_id);
}

static inline void bq_update_cell_voltage(const BQ769x2* const p_bq){
	p_bq->base.interface->update_cell_voltage((AFE*)p_bq);
}

#endif /* COMPONENT_AFE_BQ769X2_H_ */
